mjwhite8119/DCMotor-Driver-ESP32/include/I2C_Config.h
#pragma once

#ifndef Arduino
  #include <Arduino.h>
#endif

#include "Wire.h"
#include "shmem_buffer.h"
#include "ESP32RPiSlave.h"
#ifndef WireSlave
  #include <WireSlave.h>
#endif

// Addresses for esp32s
#define I2C_DEV_ADDR 0x55

#define I2C_SDA 21
#define I2C_SCL 22

int howManyBytesReceived;
uint8_t registerCode;

// Buffer and delay time
ESP32RPiSlave<Data, 20> rPiLink;

int i=0;
// Outgoing to the wire
void onRequest(){

  // Wire.print(i++);
  // Wire.print(" Packets.");
  Serial.println("onRequest");
  Serial.println(rPiLink.transmit());
  Wire.print(rPiLink.transmit());
}

// Incoming from the wire
void onReceive(int len){
  
  // rPiLink.receive(len);

  Serial.printf("onReceive[%d]: ", len);
  while(Wire.available()){
    Serial.print(Wire.read());
  }
  Serial.println();
}

void setupI2C() {
 
  // rPiLink.init(I2C_DEV_ADDR);
  pinMode(I2C_SDA, INPUT_PULLUP);
  pinMode(I2C_SCL, INPUT_PULLUP);

  // Join I2C bus as slave with address 0x20 Arduino 1
  // Use the defaults for SDA and SCL
  bool ready = Wire.begin((uint8_t)I2C_DEV_ADDR);
  
  Wire.onReceive(onReceive); // receive register value
  Wire.onRequest(onRequest); // send register value
  
  Serial.println("Setup I2C");

#if CONFIG_IDF_TARGET_ESP32
  char message[64];
  snprintf(message, 64, "%u Packets.", i++);
  Wire.slaveWrite((uint8_t *)message, strlen(message));
#endif
}

void i2cScan() {
  byte error, address;
  int nDevices;
  Serial.println("Scanning...");
  nDevices = 0;
  for(address = 1; address < 127; address++ ) {
    Wire.beginTransmission(address);
    error = Wire.endTransmission();
    if (error == 0) {
      Serial.print("I2C device found at address 0x");
      if (address<16) {
        Serial.print("0");
      }
      Serial.println(address,HEX);
      nDevices++;
    }
    else if (error==4) {
      Serial.print("Unknow error at address 0x");
      if (address<16) {
        Serial.print("0");
      }
      Serial.println(address,HEX);
    }    
  }
  if (nDevices == 0) {
    Serial.println("No I2C devices found\n");
  }
  else {
    Serial.println("done\n");
  }
}